** loop inside a list
http://stackoverflow.com/questions/39941393/python-loop-a-list-of-list-and-assign-value-inside-the-loop
#+begin_src python :results output
alist1 = [[1,2],[3,4],[5,6]]
for item in alist1:
    item=1
print(alist1)


alist2 = [[1,2],[3,4],[5,6]]
for item in alist2:
    item=item.append(10)
print(alist2)


alist3 = [[1,2],[3,4],[5,6]]
for item in alist3:
    item.append(10)
print(alist3)

#+end_src

#+results:
: [[1, 2], [3, 4], [5, 6]]
: [[1, 2, 10], [3, 4, 10], [5, 6, 10]]
: [[1, 2, 10], [3, 4, 10], [5, 6, 10]]
** get the time as pdt (day time saving)
#+begin_src python :results output
 import pytz
 from datetime import datetime
 ptd = pytz.timezone("america/los_angeles")
 a= datetime.now(ptd)
 print a
#+end_src

#+results:
: 2016-10-25 00:15:01.870243-07:00

